---
title: AssetPropertyDouble
classe: Autodesk.Revit.DB.Visual.AssetPropertyDouble
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# AssetPropertyDouble

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Value { get; set; }` | `assetPropertyDouble.Value` | Double |
| `Boolean IsValidValue(Double)` | `assetPropertyDouble.IsValidValue(value)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```